use bookstore;

insert into book
(name, publisher, year, price, count, date_of_receipt, description)
values
("Идиот", "Наука", 1990, 350, 0, "2020-11-11", "d0"),
("Бесы", "Наука", 1988, 370, 0, "2020-09-11", "d1"),
("Война и мир", "Наука", 2009, 400, 0, "2020-11-05", "d2"),
("Палач", "Питер", 2019, 550, 0, "2020-11-05", "d3"),
("Черный обелиск", "Феникс", 1993, 310, 50, "2020-11-05", "d4"),
("Капитал", "Питер", 2011, 660, 30, "2019-11-05", "d5"),
("Лолита", "Питер", 2000, 490, 8, "2018-11-05", "d6"),
("Сияние", "Питер", 2018, 500, 11, "2020-11-05", "d7"),
("1984", "Питер", 2010, 550, 10, "2020-11-05", "d8");

insert into author
(first_name, last_name)
values
("Федор", "Достоевский"),
("Лев", "Толстой "),
("Эдуард", "Лимонов"),
("Мария", "Ремарк"),
("Карл", "Маркс"),
("Владимир", "Набоков"),
("Стивен", "Кинг"),
("Джордж", "Оруэлл");

insert into author_book
(book_id, author_id)
values
(1, 1),
(2, 1),
(3, 2),
(4, 3),
(5, 4),
(6, 5),
(7, 6),
(8, 7),
(9, 8);

insert into user
(name)
values
("admin"),
("Alexey");

insert into order_t
(user_id, total_price, status_code, init_date, exec_date)
values
(2, 1000, 0, '2021-01-01', null),
(2, 2000, 0, '2021-01-01', null),
(2, 350, 1, '2021-01-01', '2021-01-02'),
(2, 2000, 1, '2021-01-01', '2021-01-02'),
(2, 1500, 0, '2021-01-01',  null),
(2, 1000, 2, '2021-01-01', '2021-01-02'),
(2, 700, 0, '2021-01-01', null);

insert into request
(name, status_code, count)
values
("достоевский", 0, 3),
("достоевский бесы", 0, 1),
("идиот", 0, 2),
("Request for book with id = 2", 1, 2);

insert into book_request
(book_id, request_id)
values 
(2, 1),
(2, 2),
(1, 1),
(1, 3),
(2, 4);

insert into order_book
(order_id, book_id, book_count)
values
(1, 1, 1),
(1, 2, 1),
(2, 2, 1),
(3, 1, 1),
(3, 3, 1),
(4, 5, 1),
(4, 6, 1),
(5, 6, 1),
(6, 3, 1),
(7, 4, 1),
(7, 7, 1),
(7, 8, 1);

insert into order_request
(order_id, request_id)
values
(1, 4),
(3, 4);